# Pandas

Pandas is a powerful and versatile library that simplifies the tasks of data manipulation in Python. Pandas is well-suited for working with tabular data, such as spreadsheets or SQL tables.

The Pandas library is an essential tool for data analysts, scientists, and engineers working with structured data in Python.


* It is an open source data analysis library written in Python.
* It leverages the power and speed of NumPy to make data analysis and preprocessing easy.
* It provides rich and highly robust data operations.



## Pandas Data Structure

**Pandas has two types of DS :**

 * **Series** : 1D array with indexes, it stores a single column or row of data in a Dataframe.


   It's a 1D array(labeled) capable of holding any type of data.
   
 * **Dataframe** : Tabular spreadsheet like structure representing rows each of which contains one or multiple columns.


   It's a 2D data(labeled) structure with columns of potentially different types of data.

-----------------------------------------------------------------------------------------

In [101]:
import pandas as pd                                   # pip install pandas
import numpy as np

In [102]:
dict = {
    "name" : ['Harry', 'Ron', 'Hermione'],
    "id" : ['07', '06', '01'],
    "marks" : ['50', '50', '112'],
    "place" : ['Surrey', 'London', 'Australia'],
}

In [103]:
df = pd.DataFrame(dict)                       # creates data frame, kind of an excel sheet, for faster indexing, organizing 
df

       name  id marks      place
0     Harry  07    50     Surrey
1       Ron  06    50     London
2  Hermione  01   112  Australia

index  --> rows

columns  -->  columns

Display particular Data

In [104]:
df.head(2)                                              # display x rows from the top

    name  id marks   place
0  Harry  07    50  Surrey
1    Ron  06    50  London

In [105]:
df.tail(2)                                              # displays x rows from the bottom

       name  id marks      place
1       Ron  06    50     London
2  Hermione  01   112  Australia

In [106]:
df.sample(2)                                            # displays random x rows

       name  id marks      place
2  Hermione  01   112  Australia
0     Harry  07    50     Surrey

Description of the data

In [107]:
df.describe()

         name  id marks   place
count       3   3     3       3
unique      3   3     2       3
top     Harry  07    50  Surrey
freq        1   1     2       1

Export CSV files

In [108]:
df.to_csv('info.csv')                                       # exporting to csv file that is excel sheet

In [109]:
df.to_csv('info_no_index.csv', index=False)                 # to hide index

In [110]:
df.index = ['i', 'ii', 'iii']                               # change the index 
df

         name  id marks      place
i       Harry  07    50     Surrey
ii        Ron  06    50     London
iii  Hermione  01   112  Australia

Renaming Columns

In [190]:
df.columns

Index(['name', 'id', 'marks', 'place'], dtype='object')

In [191]:
df.rename(columns={'name':'Name', 'id':'Id', 'marks':'Marks', 'place':'Place'}, inplace=True)

In [192]:
df.head()

         Name  Id Marks      Place
i       Harry  07    50     Surrey
ii        Ron  06    50     London
iii  Hermione  01   112  Australia

---------------------------------------------------------------------------------------

Read CSV files

In [111]:
details = pd.read_csv('details.csv')                          # reading a csv file
details

               Book         Author    Year
0      Harry Potter     JK Rowling  1997.0
1      Six of Crows  Leigh Bardugo  2015.0
2            AGGGTM  Holly Jackson  2019.0
3  The Cruel Prince    Holly Black     NaN
4   Throne of Glass   Sarah J Mass  2012.0

In [112]:
details.columns = details.columns.str.strip()                           # remove extra white spaces

In [113]:
details['Book']

0        Harry Potter
1        Six of Crows
2              AGGGTM
3    The Cruel Prince
4     Throne of Glass
Name: Book, dtype: object

In [114]:
details['Year'][0]

1997.0

In [115]:
#details['Year'][1] = 2015                      #change value
#details.to_csv('details.csv')

---------------------------------------------------------------------------------------

In [116]:
sr = pd.Series(np.random.rand)                                # generates random floating-point numbers between 0-1
sr

0    <built-in method rand of numpy.random.mtrand.R...
dtype: object

In [117]:
type(sr)

pandas.core.series.Series

In [118]:
sr = pd.Series(np.random.rand(5))
sr

0    0.548745
1    0.723098
2    0.665862
3    0.160203
4    0.297691
dtype: float64

---------------------------------------------------------------------------------------

In [119]:
dataf = pd.DataFrame(np.random.rand(100,5), index = np.arange(100))
dataf

           0         1         2         3         4
0   0.123156  0.238906  0.854013  0.321454  0.924501
1   0.829957  0.082526  0.898882  0.702453  0.561925
2   0.152600  0.293425  0.878322  0.924719  0.852891
3   0.663906  0.169698  0.856403  0.789484  0.291239
4   0.910742  0.040766  0.186427  0.128770  0.538214
..       ...       ...       ...       ...       ...
95  0.478546  0.181123  0.429045  0.662573  0.958692
96  0.230189  0.757637  0.728104  0.414319  0.383180
97  0.887617  0.016704  0.081143  0.649594  0.889589
98  0.706603  0.863383  0.895778  0.025787  0.924507
99  0.352633  0.013400  0.609602  0.699938  0.871482

[100 rows x 5 columns]

In [120]:
type(dataf)

pandas.core.frame.DataFrame

In [121]:
dataf.describe()

                0           1           2           3           4
count  100.000000  100.000000  100.000000  100.000000  100.000000
mean     0.514188    0.466666    0.429786    0.513351    0.546205
std      0.266110    0.300441    0.289364    0.263961    0.311056
min      0.050631    0.002031    0.006599    0.004623    0.006237
25%      0.307586    0.201248    0.157178    0.327312    0.283330
50%      0.505573    0.452969    0.382033    0.495807    0.571636
75%      0.724811    0.722574    0.702488    0.699001    0.833201
max      0.994356    0.984329    0.906632    0.993323    0.980529

In [122]:
dataf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [123]:
dataf.head()

          0         1         2         3         4
0  0.123156  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925
2  0.152600  0.293425  0.878322  0.924719  0.852891
3  0.663906  0.169698  0.856403  0.789484  0.291239
4  0.910742  0.040766  0.186427  0.128770  0.538214

In [124]:
dataf[0][0] = "Name"
dataf.head()

C:\Users\shubh\AppData\Local\Temp\ipykernel_14736\2823997240.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  dataf[0][0] = "Name"
C:\Users\shubh\AppData\Local\Temp\ipykernel_14736\2823997240.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Name' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  dataf[0][0] = "Name"

          0         1         2         3         4
0      Name  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925
2    0.1526  0.293425  0.878322  0.924719  0.852891
3  0.663906  0.169698  0.856403  0.789484  0.291239
4  0.910742  0.040766  0.186427  0.128770  0.538214

In [125]:
dataf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [126]:
dataf.index

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35,
       36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53,
       54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
       72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89,
       90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
      dtype='int32')

In [127]:
dataf.columns

RangeIndex(start=0, stop=5, step=1)

Converting to Numpy Array

In [128]:
dataf.to_numpy()                             # convert into numpy array

array([['Name', 0.23890552979990343, 0.8540129075812187,
        0.3214544166254002, 0.9245013510566181],
       [0.8299574666138686, 0.08252580093632789, 0.8988820329928612,
        0.7024533383544596, 0.5619250321604241],
       [0.15259991002073559, 0.29342548004639735, 0.8783217922118779,
        0.9247192542196006, 0.8528906126347884],
       [0.6639058720111177, 0.16969815160895674, 0.8564028392435974,
        0.7894841589343262, 0.29123891372391897],
       [0.9107420316457207, 0.040766047901665714, 0.1864271588076758,
        0.12877011742451017, 0.5382138895311845],
       [0.6930349709369326, 0.07556536023084814, 0.1846131956158622,
        0.3749999313985314, 0.7074021791426401],
       [0.3968948706077561, 0.4622733306100235, 0.23036921860195858,
        0.7923303455535389, 0.19086693181841197],
       [0.3109453582640539, 0.0020312817787629944, 0.5597797504637977,
        0.9933234300897023, 0.5927700874264956],
       [0.530214971345689, 0.9650658927601965, 0.1651495413752584,
        0.4718686151528513, 0.33260814686401885],
       [0.8902877501486427, 0.33441602721049624, 0.029582519906665605,
        0.42146642889606145, 0.4408551976111308],
       [0.5209921940171094, 0.2013448716428835, 0.7008802506290285,
        0.6724179814620658, 0.7147351421552904],
       [0.3055776068339674, 0.5397848676068552, 0.10830481258177871,
        0.2790695932858086, 0.378046295488772],
       [0.25838642251136434, 0.552142538237104, 0.8595394171855825,
        0.4475013261239954, 0.023916453405247062],
       [0.42611239344427354, 0.9467295539244145, 0.463215283899706,
        0.32926500780987866, 0.2281991082389745],
       [0.6534780596332938, 0.5424115566719824, 0.3004516423188489,
        0.8280646904014424, 0.9789974152438898],
       [0.9781196672986323, 0.9433232980076047, 0.6374077566265514,
        0.21411249192166015, 0.45436278623788995],
       [0.20550102861076858, 0.5354436095780382, 0.9066315276500199,
        0.33832416184917047, 0.6695121540003404],
       [0.5794272303717823, 0.8902703636669832, 0.771173675455446,
        0.16067516438443863, 0.9747449193202758],
       [0.8570874513347949, 0.9495931363455927, 0.5310440693114958,
        0.583559516382307, 0.12968879143695833],
       [0.151951440800295, 0.7467572399033447, 0.11762731656035119,
        0.6097287577655389, 0.28574978567697806],
       [0.3696238568967283, 0.6032008343537537, 0.8238068610709008,
        0.7656166038213912, 0.08252281802161743],
       [0.7861526639872015, 0.37624676054907846, 0.07660572400198562,
        0.48917179148226364, 0.8918816145158606],
       [0.3112878624509361, 0.336458845701715, 0.38415147758520607,
        0.4501071301566175, 0.7952172775796116],
       [0.3451955988040992, 0.45432103009939817, 0.11665441763139517,
        0.2886476931745744, 0.9044265724888753],
       [0.16848111269833932, 0.38560787957612863, 0.00659879702303634,
        0.8803074308430493, 0.38646127661514773],
       [0.6265854411856578, 0.04346027326249824, 0.2752275458770215,
        0.7979708361138932, 0.21787571079790025],
       [0.2697042839875108, 0.27370727416050467, 0.13715660322546586,
        0.6706618796469106, 0.9512774788923044],
       [0.9336653767836641, 0.6344266314110482, 0.07421175385788414,
        0.6583926324585893, 0.20436430603689304],
       [0.7383477016157209, 0.20095927609357123, 0.7728742093692692,
        0.8756714765869329, 0.8569563861220775],
       [0.7875557681826875, 0.09024643480994488, 0.6535536656425552,
        0.6602123505646905, 0.4054439004874034],
       [0.3470594018646407, 0.5158602024560301, 0.6520195485588436,
        0.6781602597134491, 0.6877552854477765],
       [0.7468161089235054, 0.21249773087320423, 0.754932449539522,
        0.4076208018750914, 0.5600035653606135],
       [0.09942197611455916, 0.19085189732711705, 0.08987823435369013,
        0.37665829224137815, 0.3427748676720187],
       [0.9833082449049528, 0.6178459549229041, 0.008732101284418703,
        0.4932207732705942, 0.7970809868113612],
       [0.5731088711243012, 0.982965772600039, 0.13113003213584162,
        0.6816872320287307, 0.9521117486604104],
       [0.7060787756159924, 0.6324262200758666, 0.4155083361651709,
        0.6652816836526597, 0.5809079885451554],
       [0.3057563282094329, 0.7989715802123344, 0.4941209779886854,
        0.22981954383758418, 0.7207170498667291],
       [0.6775610457375353, 0.07097197623184948, 0.5285404933811393,
        0.07654049447016675, 0.09253218773660443],
       [0.8961086747438645, 0.27142537404606315, 0.2744590686323086,
        0.3528407695335163, 0.7416464342678202],
       [0.5992639587912889, 0.8719831078614543, 0.1629183853098759,
        0.6022765411774658, 0.6428527454702567],
       [0.6538222603962043, 0.6603443557326935, 0.02874117190933434,
        0.26673960602415914, 0.09405625272106599],
       [0.3740144351119121, 0.7985056900526113, 0.13427457597246628,
        0.4983929739934019, 0.46917652948416355],
       [0.49015288725486905, 0.22108732517040108, 0.2591311297554715,
        0.9640049780098429, 0.9547530196952949],
       [0.673781237797832, 0.664807315863914, 0.17937111796074034,
        0.33013630752863554, 0.3201395224077903],
       [0.39231554392233337, 0.4695510733632918, 0.31521060940140144,
        0.6986890277709836, 0.165714066358148],
       [0.7226559750280838, 0.25351266849873677, 0.12463951588651112,
        0.12314975396748695, 0.08178387919883034],
       [0.31709898025946903, 0.17843658433474996, 0.05712061168929794,
        0.825629871043642, 0.7494196931707174],
       [0.7079682258582061, 0.3784033753987158, 0.6518486294675857,
        0.582093674404324, 0.06708637850948518],
       [0.29524405849504176, 0.7181060791972231, 0.043594175427248194,
        0.6553894262322215, 0.35105389578068313],
       [0.9362083211947262, 0.23522068524192163, 0.6349872482410719,
        0.3935559728268945, 0.8869079187871082],
       [0.8927028908546655, 0.15665718718065869, 0.19979853233372202,
        0.287077577562337, 0.7190089368626681],
       [0.07032584920222784, 0.3248973291752041, 0.7458577373491061,
        0.688332938185181, 0.9244424580284949],
       [0.1836301588114766, 0.8468315633562769, 0.8212575687107264,
        0.5590640075165525, 0.9268701417290478],
       [0.9465957290717315, 0.018997959402768827, 0.7094630461154267,
        0.4213052869969981, 0.9544704944056096],
       [0.43257173045556985, 0.44275030720449104, 0.33437046659909486,
        0.9828012256345318, 0.9584394536407524],
       [0.7544445672854663, 0.48928642737445804, 0.7073129176485647,
        0.8016427698677974, 0.953205502507494],
       [0.7097299643962762, 0.8743526104242384, 0.06738727051295057,
        0.7838370962346308, 0.20815648537999099],
       [0.12425340316619027, 0.382086130081587, 0.4808314208931158,
        0.4360590750700629, 0.27607199948310623],
       [0.30844776037408694, 0.08461827500929009, 0.4015377268723055,
        0.24020277603137985, 0.17585746011283288],
       [0.545624463098262, 0.24214302413963418, 0.01037204294676286,
        0.4735168599090772, 0.41394576748016054],
       [0.4025879201904058, 0.9541593966036812, 0.6608798176187868,
        0.7473987763292989, 0.9805289012233663],
       [0.6478268625732612, 0.12464726695859452, 0.8546224990723422,
        0.611192761429339, 0.688474458585233],
       [0.40134637200554724, 0.3005910369312189, 0.2504466047052286,
        0.8713213015717869, 0.2960909108783344],
       [0.8343959378363318, 0.33227429268436504, 0.25453481266675293,
        0.21962954189832318, 0.8180887316353438],
       [0.19973505958477344, 0.9402635020131761, 0.5563511061829746,
        0.05403397480227479, 0.006237014557350928],
       [0.16701614392866204, 0.24831287014389392, 0.08385006198829448,
        0.9775225386476921, 0.01885005703536935],
       [0.5851816511317116, 0.7641990779439172, 0.37658639273222083,
        0.6775487126588237, 0.7629263028592382],
       [0.33831931872392906, 0.7153818430997035, 0.27992938230830755,
        0.6628924198472881, 0.7047294713376533],
       [0.21567951829496268, 0.5742048864705924, 0.8031625783902683,
        0.5362614556132815, 0.030990323922721386],
       [0.7312755900192549, 0.9569704263535007, 0.8350332038553244,
        0.37634846104601904, 0.7400624538031202],
       [0.5877321638322948, 0.8536633286984056, 0.6276639048314325,
        0.16961057021852932, 0.15397394415102217],
       [0.8474371548424298, 0.7459375713022958, 0.882161461136235,
        0.8290096832347071, 0.3268426775897846],
       [0.19866464818865226, 0.8229573384491479, 0.04140735028099796,
        0.7629384133228829, 0.14663229252907495],
       [0.13764807489163833, 0.8765543957990495, 0.8545104611967961,
        0.16357382038683732, 0.30644410284927825],
       [0.3121265200157324, 0.7170586482118816, 0.1159126478881305,
        0.8457868078257199, 0.9291575912115518],
       [0.19464003143120234, 0.6948170239413678, 0.4150084707772794,
        0.29805516869454896, 0.6198066839582445],
       [0.3706549427939242, 0.4162505260945957, 0.6912664297975923,
        0.6766034521500306, 0.38221685660539706],
       [0.31549523258649415, 0.11461574517273354, 0.9046730547096801,
        0.33410796529420195, 0.8683750892783094],
       [0.5308572346778542, 0.4943546794534599, 0.45561053063252666,
        0.6909053022182667, 0.6330828038443758],
       [0.5599790871367435, 0.5155102690821666, 0.36256258063530344,
        0.3709580055382077, 0.1650331040129921],
       [0.9903303561364529, 0.6851353595609586, 0.0483709558722607,
        0.4808393832529645, 0.9487141325404046],
       [0.7709982615750367, 0.14616359320283512, 0.71640930264419,
        0.7225732802649106, 0.24048012520271256],
       [0.4165435020234318, 0.056081075110164136, 0.40467817081149027,
        0.2823740806985834, 0.08606724938954902],
       [0.34337195268570186, 0.4516178611633337, 0.32170612891792283,
        0.4405695998101353, 0.810987671664333],
       [0.44677183561431966, 0.32759361678032006, 0.37991518684254477,
        0.9679608292075635, 0.7650686673925402],
       [0.2915566068169505, 0.2820818214751416, 0.10767498906205886,
        0.9016260249741206, 0.562363407980749],
       [0.5358856051667665, 0.8821372448433719, 0.8160984434853128,
        0.014096757031378582, 0.7867996992441063],
       [0.3081953768045481, 0.9843285322231841, 0.3184361746004495,
        0.39164957051753324, 0.5537557671373745],
       [0.09410721374906028, 0.7359763421822297, 0.3046244073935711,
        0.011245926215826763, 0.3275456095148088],
       [0.9283141467636812, 0.06802663069660309, 0.37898796149479663,
        0.004623053211061934, 0.7173316694670395],
       [0.6948830850194153, 0.16397045845268488, 0.3046755436208325,
        0.12503477999227797, 0.23164551065800643],
       [0.9943563877917003, 0.05421708076224663, 0.1399576305189213,
        0.013514004697381954, 0.4758775342873266],
       [0.29083246158418585, 0.17274251627453374, 0.8580953704869587,
        0.377853820929141, 0.04179602165736607],
       [0.786765731162157, 0.6108324319459506, 0.368677733360694,
        0.5407109454813355, 0.8266379307366145],
       [0.050631087462425506, 0.5331878640605899, 0.4804695537192881,
        0.2364580238136179, 0.902803577047572],
       [0.4785460535102255, 0.18112276827127927, 0.4290453271531517,
        0.6625725192451256, 0.9586922591557693],
       [0.23018930888513423, 0.7576372678725832, 0.7281041129387588,
        0.41431921141074046, 0.3831799431678272],
       [0.887616949111664, 0.016704013658577654, 0.08114326515539594,
        0.6495935800893237, 0.8895890179789552],
       [0.706603039365261, 0.8633830023369937, 0.8957779457010313,
        0.025787459499594934, 0.9245073819502219],
       [0.35263311343928494, 0.01339980787826267, 0.6096017190492897,
        0.6999376075355253, 0.871481821280358]], dtype=object)

Transpose of data

In [129]:
dataf.T                         # transpose

,0,1,2,3,4,5,6,7,8,9,...,90,91,92,93,94,95,96,97,98,99
0,Name,0.829957,0.1526,0.663906,0.910742,0.693035,0.396895,0.310945,0.530215,0.890288,...,0.694883,0.994356,0.290832,0.786766,0.050631,0.478546,0.230189,0.887617,0.706603,0.352633
1,0.238906,0.082526,0.293425,0.169698,0.040766,0.075565,0.462273,0.002031,0.965066,0.334416,...,0.16397,0.054217,0.172743,0.610832,0.533188,0.181123,0.757637,0.016704,0.863383,0.0134
2,0.854013,0.898882,0.878322,0.856403,0.186427,0.184613,0.230369,0.55978,0.16515,0.029583,...,0.304676,0.139958,0.858095,0.368678,0.48047,0.429045,0.728104,0.081143,0.895778,0.609602
3,0.321454,0.702453,0.924719,0.789484,0.12877,0.375,0.79233,0.993323,0.471869,0.421466,...,0.125035,0.013514,0.377854,0.540711,0.236458,0.662573,0.414319,0.649594,0.025787,0.699938
4,0.924501,0.561925,0.852891,0.291239,0.538214,0.707402,0.190867,0.59277,0.332608,0.440855,...,0.231646,0.475878,0.041796,0.826638,0.902804,0.958692,0.38318,0.889589,0.924507,0.871482

Sorting data in descending order (rows)

In [130]:
dataf.sort_index(axis=0, ascending=False)                       # ascending is true by default, make it false to sort in descending order

           0         1         2         3         4
99  0.352633  0.013400  0.609602  0.699938  0.871482
98  0.706603  0.863383  0.895778  0.025787  0.924507
97  0.887617  0.016704  0.081143  0.649594  0.889589
96  0.230189  0.757637  0.728104  0.414319  0.383180
95  0.478546  0.181123  0.429045  0.662573  0.958692
..       ...       ...       ...       ...       ...
4   0.910742  0.040766  0.186427  0.128770  0.538214
3   0.663906  0.169698  0.856403  0.789484  0.291239
2     0.1526  0.293425  0.878322  0.924719  0.852891
1   0.829957  0.082526  0.898882  0.702453  0.561925
0       Name  0.238906  0.854013  0.321454  0.924501

[100 rows x 5 columns]

Sorting data in descending order (columns)

In [131]:
dataf.sort_index(axis=1, ascending=False)

           4         3         2         1         0
0   0.924501  0.321454  0.854013  0.238906      Name
1   0.561925  0.702453  0.898882  0.082526  0.829957
2   0.852891  0.924719  0.878322  0.293425    0.1526
3   0.291239  0.789484  0.856403  0.169698  0.663906
4   0.538214  0.128770  0.186427  0.040766  0.910742
..       ...       ...       ...       ...       ...
95  0.958692  0.662573  0.429045  0.181123  0.478546
96  0.383180  0.414319  0.728104  0.757637  0.230189
97  0.889589  0.649594  0.081143  0.016704  0.887617
98  0.924507  0.025787  0.895778  0.863383  0.706603
99  0.871482  0.699938  0.609602  0.013400  0.352633

[100 rows x 5 columns]

In [132]:
type(dataf[1])

pandas.core.series.Series

In [133]:
dataf2 = dataf                # dataf2 is a view of dataf , that is it is at the same location it just points to dataf

In [134]:
dataf2[0][0] = 866

In [135]:
dataf.head(2)                    # changes made to dataf2 get reflected in  dataf

          0         1         2         3         4
0       866  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925

Creating copy of data

In [136]:
dataf3 = dataf.copy()                   # dataf3 is a copy of dataf

It is hard to track the changed values from view and copy and also confusing for the system to print which value and when therefore "loc" is used.

In [137]:
dataf.loc[0,0] = 6

In [138]:
dataf.head(2)

          0         1         2         3         4
0         6  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925

In [139]:
dataf.columns = list('ABCDE')
dataf.head(3)

          A         B         C         D         E
0         6  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925
2    0.1526  0.293425  0.878322  0.924719  0.852891

In [140]:
# since the column values are now changed
dataf.loc[2, 'C'] = 4                                   
dataf.head(3)

          A         B         C         D         E
0         6  0.238906  0.854013  0.321454  0.924501
1  0.829957  0.082526  0.898882  0.702453  0.561925
2    0.1526  0.293425  4.000000  0.924719  0.852891

In [141]:
# if used [2, 2], it will create a new column 2 and then aplly changes; the rest of the values will be none

dataf.loc[2,2] = 4
dataf.head(3)

          A         B         C         D         E    2
0         6  0.238906  0.854013  0.321454  0.924501  NaN
1  0.829957  0.082526  0.898882  0.702453  0.561925  NaN
2    0.1526  0.293425  4.000000  0.924719  0.852891  4.0

In [142]:
dataf.drop(2, axis=1)                                   # delete column 2;  specifying axis is necessar, it uses axis0 by default

           A         B         C         D         E
0          6  0.238906  0.854013  0.321454  0.924501
1   0.829957  0.082526  0.898882  0.702453  0.561925
2     0.1526  0.293425  4.000000  0.924719  0.852891
3   0.663906  0.169698  0.856403  0.789484  0.291239
4   0.910742  0.040766  0.186427  0.128770  0.538214
..       ...       ...       ...       ...       ...
95  0.478546  0.181123  0.429045  0.662573  0.958692
96  0.230189  0.757637  0.728104  0.414319  0.383180
97  0.887617  0.016704  0.081143  0.649594  0.889589
98  0.706603  0.863383  0.895778  0.025787  0.924507
99  0.352633  0.013400  0.609602  0.699938  0.871482

[100 rows x 5 columns]

In [143]:
dataf.loc[[1,2], ['C', 'D']]                          # returns a copy

          C         D
1  0.898882  0.702453
2  4.000000  0.924719

In [144]:
dataf.loc[:, ['C','D']]

           C         D
0   0.854013  0.321454
1   0.898882  0.702453
2   4.000000  0.924719
3   0.856403  0.789484
4   0.186427  0.128770
..       ...       ...
95  0.429045  0.662573
96  0.728104  0.414319
97  0.081143  0.649594
98  0.895778  0.025787
99  0.609602  0.699938

[100 rows x 2 columns]

In [145]:
dataf.loc[[1,2], :]

          A         B         C         D         E    2
1  0.829957  0.082526  0.898882  0.702453  0.561925  NaN
2    0.1526  0.293425  4.000000  0.924719  0.852891  4.0

In [146]:
dataf.loc[(dataf['A']>0.3)]         # running complex queries

           A         B         C         D         E   2
0          6  0.238906  0.854013  0.321454  0.924501 NaN
1   0.829957  0.082526  0.898882  0.702453  0.561925 NaN
3   0.663906  0.169698  0.856403  0.789484  0.291239 NaN
4   0.910742  0.040766  0.186427  0.128770  0.538214 NaN
5   0.693035  0.075565  0.184613  0.375000  0.707402 NaN
..       ...       ...       ...       ...       ...  ..
93  0.786766  0.610832  0.368678  0.540711  0.826638 NaN
95  0.478546  0.181123  0.429045  0.662573  0.958692 NaN
97  0.887617  0.016704  0.081143  0.649594  0.889589 NaN
98  0.706603  0.863383  0.895778  0.025787  0.924507 NaN
99  0.352633  0.013400  0.609602  0.699938  0.871482 NaN

[78 rows x 6 columns]

In [147]:
dataf.loc[(dataf['A']>0.3) & (dataf['D']<0.2)]         # running complex queries

           A         B         C         D         E   2
4   0.910742  0.040766  0.186427  0.128770  0.538214 NaN
17  0.579427  0.890270  0.771174  0.160675  0.974745 NaN
37  0.677561  0.070972  0.528540  0.076540  0.092532 NaN
45  0.722656  0.253513  0.124640  0.123150  0.081784 NaN
70  0.587732  0.853663  0.627664  0.169611  0.153974 NaN
86  0.535886  0.882137  0.816098  0.014097  0.786800 NaN
89  0.928314  0.068027  0.378988  0.004623  0.717332 NaN
90  0.694883  0.163970  0.304676  0.125035  0.231646 NaN
91  0.994356  0.054217  0.139958  0.013514  0.475878 NaN
98  0.706603  0.863383  0.895778  0.025787  0.924507 NaN

In [148]:
dataf.iloc[0,4]                                         # use "iloc" to target values by counting index
                                                        # use "loc" if wanna use names of index and columns

0.9245013510566181

In [149]:
dataf.iloc[[0,4], [4, 1]]

          E         B
0  0.924501  0.238906
4  0.538214  0.040766

In [150]:
dataf.iloc[0:2, 0:2]

          A         B
0         6  0.238906
1  0.829957  0.082526

Delete values

In [151]:
dataf.drop([0])                                           # remove a row
# dataf.drop(['A', 'C'], axis =1)                         # drop multiple columns at once

           A         B         C         D         E    2
1   0.829957  0.082526  0.898882  0.702453  0.561925  NaN
2     0.1526  0.293425  4.000000  0.924719  0.852891  4.0
3   0.663906  0.169698  0.856403  0.789484  0.291239  NaN
4   0.910742  0.040766  0.186427  0.128770  0.538214  NaN
5   0.693035  0.075565  0.184613  0.375000  0.707402  NaN
..       ...       ...       ...       ...       ...  ...
95  0.478546  0.181123  0.429045  0.662573  0.958692  NaN
96  0.230189  0.757637  0.728104  0.414319  0.383180  NaN
97  0.887617  0.016704  0.081143  0.649594  0.889589  NaN
98  0.706603  0.863383  0.895778  0.025787  0.924507  NaN
99  0.352633  0.013400  0.609602  0.699938  0.871482  NaN

[99 rows x 6 columns]

In [152]:
# keep in mind that the original dataframe is intact, only the copy is getting change!

# to make changes in the original dataframe
dataf = dataf.drop([0])

In [153]:
# or can use "inplace"

# 'inplace' modifies the originaal data right there 

dataf.drop([2], axis=1, inplace=True)

In [154]:
dataf

           A         B         C         D         E
1   0.829957  0.082526  0.898882  0.702453  0.561925
2     0.1526  0.293425  4.000000  0.924719  0.852891
3   0.663906  0.169698  0.856403  0.789484  0.291239
4   0.910742  0.040766  0.186427  0.128770  0.538214
5   0.693035  0.075565  0.184613  0.375000  0.707402
..       ...       ...       ...       ...       ...
95  0.478546  0.181123  0.429045  0.662573  0.958692
96  0.230189  0.757637  0.728104  0.414319  0.383180
97  0.887617  0.016704  0.081143  0.649594  0.889589
98  0.706603  0.863383  0.895778  0.025787  0.924507
99  0.352633  0.013400  0.609602  0.699938  0.871482

[99 rows x 5 columns]

In [155]:
dataf.reset_index()

    index         A         B         C         D         E
0       1  0.829957  0.082526  0.898882  0.702453  0.561925
1       2    0.1526  0.293425  4.000000  0.924719  0.852891
2       3  0.663906  0.169698  0.856403  0.789484  0.291239
3       4  0.910742  0.040766  0.186427  0.128770  0.538214
4       5  0.693035  0.075565  0.184613  0.375000  0.707402
..    ...       ...       ...       ...       ...       ...
94     95  0.478546  0.181123  0.429045  0.662573  0.958692
95     96  0.230189  0.757637  0.728104  0.414319  0.383180
96     97  0.887617  0.016704  0.081143  0.649594  0.889589
97     98  0.706603  0.863383  0.895778  0.025787  0.924507
98     99  0.352633  0.013400  0.609602  0.699938  0.871482

[99 rows x 6 columns]

In [156]:
dataf.reset_index(drop=True, inplace = True)
dataf.head(3)

          A         B         C         D         E
0  0.829957  0.082526  0.898882  0.702453  0.561925
1    0.1526  0.293425  4.000000  0.924719  0.852891
2  0.663906  0.169698  0.856403  0.789484  0.291239

Check for Null Values

In [157]:
dataf['E'].isnull()

0     False
1     False
2     False
3     False
4     False
      ...
94    False
95    False
96    False
97    False
98    False
Name: E, Length: 99, dtype: bool

In [158]:
dataf['E']=None
dataf

           A         B         C         D     E
0   0.829957  0.082526  0.898882  0.702453  None
1     0.1526  0.293425  4.000000  0.924719  None
2   0.663906  0.169698  0.856403  0.789484  None
3   0.910742  0.040766  0.186427  0.128770  None
4   0.693035  0.075565  0.184613  0.375000  None
..       ...       ...       ...       ...   ...
94  0.478546  0.181123  0.429045  0.662573  None
95  0.230189  0.757637  0.728104  0.414319  None
96  0.887617  0.016704  0.081143  0.649594  None
97  0.706603  0.863383  0.895778  0.025787  None
98  0.352633  0.013400  0.609602  0.699938  None

[99 rows x 5 columns]

In [159]:
dataf['E'].isnull()

0     True
1     True
2     True
3     True
4     True
      ...
94    True
95    True
96    True
97    True
98    True
Name: E, Length: 99, dtype: bool

In [160]:
# but recommended way is

dataf.loc[:, ['E']] = None
dataf['E'].isnull()

0     True
1     True
2     True
3     True
4     True
      ...
94    True
95    True
96    True
97    True
98    True
Name: E, Length: 99, dtype: bool

In [161]:
dataf.notnull()

       A     B     C     D      E
0   True  True  True  True  False
1   True  True  True  True  False
2   True  True  True  True  False
3   True  True  True  True  False
4   True  True  True  True  False
..   ...   ...   ...   ...    ...
94  True  True  True  True  False
95  True  True  True  True  False
96  True  True  True  True  False
97  True  True  True  True  False
98  True  True  True  True  False

[99 rows x 5 columns]

---------------------------------------------------------------------------------------

In [162]:
data = pd.DataFrame({"name": ['Harry', 'Ron', 'Hermione'],
                     "home": ['Hogwarts', 'Burrow', np.nan],
                     "dob": ['31 July', pd.NaT, pd.NaT],
                    "house": ['Gryffindor', 'Gryffindor', 'Gryffindor'],
                    "role": [pd.NaT, pd.NaT, pd.NaT]})

In [163]:
data

       name      home      dob       house role
0     Harry  Hogwarts  31 July  Gryffindor  NaT
1       Ron    Burrow      NaT  Gryffindor  NaT
2  Hermione       NaN      NaT  Gryffindor  NaT

In [164]:
data.dropna()

Empty DataFrame
Columns: [name, home, dob, house, role]
Index: []

In [165]:
data.dropna(axis=1)

       name       house
0     Harry  Gryffindor
1       Ron  Gryffindor
2  Hermione  Gryffindor

In [166]:
data.dropna(how='all', axis=1)                   # drops entire row/column if all elements are na

       name      home      dob       house
0     Harry  Hogwarts  31 July  Gryffindor
1       Ron    Burrow      NaT  Gryffindor
2  Hermione       NaN      NaT  Gryffindor

Check for duplicates

In [167]:
data.duplicated()

0    False
1    False
2    False
dtype: bool

Deleting duplicate values

In [168]:
data.drop_duplicates(subset=['dob'])

    name      home      dob       house role
0  Harry  Hogwarts  31 July  Gryffindor  NaT
1    Ron    Burrow      NaT  Gryffindor  NaT

In [169]:
data.drop_duplicates(subset=['house'], keep='last')                     # keep is first by default

       name home  dob       house role
2  Hermione  NaN  NaT  Gryffindor  NaT

In [170]:
data.drop_duplicates(subset=['dob'], keep=False)

    name      home      dob       house role
0  Harry  Hogwarts  31 July  Gryffindor  NaT

In [171]:
data.shape

(3, 5)

In [172]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   home    2 non-null      object
 2   dob     1 non-null      object
 3   house   3 non-null      object
 4   role    0 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 252.0+ bytes

Check for value count

In [173]:
data['home'].value_counts(dropna=False)

home
Hogwarts    1
Burrow      1
NaN         1
Name: count, dtype: int64

In [174]:
data['name'].value_counts()

name
Harry       1
Ron         1
Hermione    1
Name: count, dtype: int64

---------------------------------------------------------------------------------------

In [175]:
idf = pd.DataFrame({ 'A': [6, 8, 2], 'B': [9, 3, 15]})
#idf = pd.DataFrame([[6, 8, 2], [9, 3, 15]], columns=['A', 'B'])
idf

   A   B
0  6   9
1  8   3
2  2  15

In [176]:
idf.describe()

              A     B
count  3.000000   3.0
mean   5.333333   9.0
std    3.055050   6.0
min    2.000000   3.0
25%    4.000000   6.0
50%    6.000000   9.0
75%    7.000000  12.0
max    8.000000  15.0

Calculate Mean

In [177]:
idf.mean()

A    5.333333
B    9.000000
dtype: float64

Calculate Median

In [178]:
idf.median()

A    6.0
B    9.0
dtype: float64

Calculate Standard Deviation

In [179]:
idf.std()

A    3.05505
B    6.00000
dtype: float64

In [180]:
idf.corr()

          A         B
A  1.000000 -0.981981
B -0.981981  1.000000

In [181]:
idf.count()

A    3
B    3
dtype: int64

Find Maximum Value

In [182]:
idf.max()

A     8
B    15
dtype: int64

Find Minimum Value

In [183]:
idf.min()

A    2
B    3
dtype: int64

In [184]:
# categorical data is data which takes on a finite number of possible values

idf['A'].astype('category')                   # category var creates category obj. he category data type in pandas is a hybrid data type. It looks and behaves like a string in many instances but internally is represented by an array of integers. This allows the data to be sorted in a custom order and to more efficiently store the data.

0    6
1    8
2    2
Name: A, dtype: category
Categories (3, int64): [2, 6, 8]

------------------------------------------------------------------------------------------

In [185]:
# handling excel files

datas = pd.read_excel('datas.xlsx')                            # openpyxl module is required (pip install openpyxl)
datas

   Unnamed: 0          Book 2.0     Author 2.0  Year 2.0
0           0      Harry Potter     JK Rowling    1997.0
1           1      Six of Crows  Leigh Bardugo    2015.0
2           2            AGGGTM  Holly Jackson    2019.0
3           3  The Cruel Prince    Holly Black    2018.0
4           4   Throne of Glass   Sarah J Mass    2012.0
5           5     Shadow & Bone  Leigh Bardugo       NaN

Reading multiple sheets

In [186]:
# for another sheet in the same file
# reading multiple sheets

# datas = pd.read_excel('datas.xlsx', sheet_name= 'Sheet2')

In [187]:
datas.iloc[3, 2] = 2018
datas

   Unnamed: 0          Book 2.0     Author 2.0  Year 2.0
0           0      Harry Potter     JK Rowling    1997.0
1           1      Six of Crows  Leigh Bardugo    2015.0
2           2            AGGGTM  Holly Jackson    2019.0
3           3  The Cruel Prince           2018    2018.0
4           4   Throne of Glass   Sarah J Mass    2012.0
5           5     Shadow & Bone  Leigh Bardugo       NaN

In [188]:
# saving the changes made to the excel file

datas.to_excel('datas.xlsx')                             # might remove other sheets, look for ways to save

Merging data

In [189]:
merge = pd.merge(datas, details, right_on='Book', left_on='Book 2.0')
merge

,Unnamed: 0,Book 2.0,Author 2.0,Year 2.0,Book,Author,Year
0,0,Harry Potter,JK Rowling,1997.0,Harry Potter,JK Rowling,1997.0
1,1,Six of Crows,Leigh Bardugo,2015.0,Six of Crows,Leigh Bardugo,2015.0
2,2,AGGGTM,Holly Jackson,2019.0,AGGGTM,Holly Jackson,2019.0
3,3,The Cruel Prince,2018,2018.0,The Cruel Prince,Holly Black,NaN
4,4,Throne of Glass,Sarah J Mass,2012.0,Throne of Glass,Sarah J Mass,2012.0

**Note:** When dealing with large datasets, do not create and leave so many dataframes of such large sizes.. it is gonna consume all the system memory.